app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
    flash[:notice] = "successfully"
    redirect_to book_path(@book.id)
    else
    @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2020-03-29 09:25:47.152216"], ["updated_at", "2020-03-29 09:25:47.152216"]]
SELECT "books".* FROM "books"

  def update
    book = Book.find(params[:id])
    book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "aaxx"], ["updated_at", "2020-03-29 10:18:44.678251"], ["id", 25]]